function T=wendu(T1,T2,T3,T4,L)
L1=(T1-25)/2.5;
L2=(T2-T1)/2.5;
L3=(T3-T2)/2.5;
L4=(T4-T3)/2.5;
L5=(T4-25)/2.5;
%各个温区的温度，10和11保持25度
    if L<=L1                  %炉前区
        T=logistic(25,T1,L1,L)+25;            %(T1-25)/25*L+25;
    elseif L>L1 && L< 197.5-(L2-5)/2      %1
        T=T1;
    elseif L>=197.5-(L2-5)/2 && L<202.5+(L2-5)/2    %1,2之间
        T=logistic(T1,T2,L2,L-(197.5-(L2-5)/2))+T1;            %T1+(T2-T1)/5*(L-197.5);
    elseif L>=202.5+(L2-5)/2 && L<233-(L3-5)/2      %2
        T=T2;
    elseif L>=233-(L3-5)/2 && L<238+(L3-5)/2        %2,3之间
        T=logistic(T2,T3,L3,L-(233-(L3-5)/2))+T2;            %(L-233)*(T3-T2)/5+T2;
    elseif L>=238+(L3-5)/2 && L<268.5-(L4-5)/2     %3
        T=T3;
    elseif L>=268.5-(L4-5)/2 && L<273.5+(L4-5)/2    %3,4之间的温度
        T=logistic(T3,T4,L4,L-(268.5-(L4-5)/2))+T3;            %(L-268.5)/5*(T4-T3)+T3;
    elseif L>=273.5+(L4-5)/2 && L<339.5             %4
        T=T4;
    elseif L>=339.5 && L<344.5+(L5-5)/2   %4,5之间,,,,4不设置缓冲缓冲，5
        T=logistic(T4,25,(L5-5)/2+5,L-339.5)+25;            %(71-(L-339.5))/71*(T4-25)+25;
    else 
        T=25;
    end
end
